export function Terms() {
  return (
    <div className="container m-auto max-w-3xl p-6 font-['Times_New_Roman'] md:p-24">
      {/* TERM 1 */}
      <div className="mb-6 text-justify leading-none">
        <h1 className="mb-[14px] text-center font-bold">1. ПРЕДМЕТ ДОГОВОРУ</h1>
        <ul className="list-inside text-base">
          <li className="leading-none">
            <span className="pl-16">1.1.</span> Відповідно до умов цього
            Договору Виконавець зобов'язується надати освітні Послуги із
            вивчення теоретичних та практичних навичок в тестуванні програмного
            забезпечення, які надається шляхом органiзацiї проведення групових
            онлайн-занять (надалі – “Послуги”), а Замовник зобов'язується
            прийняти повністю Послуги надані Виконавцем, дотримуватись
            рекомендацій щодо навчання та вчасно оплачувати Послуги.
          </li>
          <li className="leading-none">
            <span className="pl-16">1.2.</span> Вартість Послуг, час i
            перiодичнiсть надання Послуг формується Виконавцем і затверджується
            в цьому Договорі.
          </li>
          <li className="leading-none">
            <span className="pl-16">1.3.</span> Після останнього 4-го місяця
            навчання Замовник має право користуватися всіма ресурсами та
            матеріалами протягом 5 календарних днів{" "}
            <span className="underline">з дня проведення останньої лекції</span>
            . У разі припинення навчання раніше, Замовник має право
            користуватися всіма ресурсами та матеріалами протягом 5 календарних
            днів{" "}
            <span className="underline">
              з моменту повідомленням про завершення навчання
            </span>
            .
          </li>
          <li className="leading-none">
            <span className="pl-16">1.4.</span> Підписання Договору Замовником,
            відповідно до умов даного Договору, визначається як його повне та
            беззаперечне прийняття Послуг, які будуть надані Виконавцем.
          </li>
          <li className="leading-none">
            <span className="pl-16">1.5.</span> Надання додаткових Послуг, що не
            обумовлені в цьому Договорі, надаються за окрему плату.
          </li>
        </ul>
      </div>
      {/* TERM 2 */}
      <div className="mb-6 text-justify">
        <h1 className="mb-[14px] text-center font-bold">
          2. ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН
        </h1>
        <ul className="list-inside text-base">
          <li className="flex leading-none">
            <span className="pl-16">2.1.</span>
            <p className="pl-1 font-bold">Виконавець зобов'язаний:</p>
          </li>
          <li className="leading-none">
            <span className="pl-16">2.1.1.</span> Забезпечити доступ до всіх
            вказаних в Договорі ресурсів та матеріалів необхідних для якісного
            та ефективного навчання Замовника.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.1.2.</span> Надавати доступ до пройденої
            лекції та матеріалів до неї, протягом 24 (двадцяти чотирьох) годин з
            моменту проведення самої лекцій.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.1.3.</span> Надати Послуги належним чином,
            в порядку та обсягах, відповідно до умов Договору.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.1.4.</span> Здійснювати регулярно
            перевірку виконаних Замовником домашніх завдань та надавати
            регулярний зворотний зв’язок з приводу виконаних робіт.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.1.5.</span> Забезпечити Замовника
            необхідними для навчання матеріалами для результативного надання
            Послуг в обсязі, який визначається Виконавцем самостійно.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.1.6.</span> Надати самостійно, або із
            залученням іншої третьої особи, повну технічну і моральну
            (психологічну) підтримку в межах строку дії Договору.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.1.7.</span> Повідомляти Замовника про
            зміну графіку проведення лекції не пізніше, ніж за 12 годин до
            початку самої лекції.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.1.8.</span> При виникненні обставин, що
            перешкоджають належному виконанню своїх зобов’язань, згідно з цим
            Договором, терміново повідомляти про це Замовника протягом 3 (трьох)
            календарного дня з дня виникнення таких обставин. Повідомлення
            Замовника здійснюється в телефонному режимі, згідно з контактами,
            вказаних Замовником в Договорі.
          </li>
        </ul>
        <ul className="list-inside text-base">
          <li className="flex pt-5 leading-none">
            <span className="pl-16">2.2.</span>
            <p className="pl-1 font-bold">Замовник зобов'язаний:</p>
          </li>
          <li className="leading-none">
            <span className="pl-16">2.2.1.</span> Своєчасно оплачувати Послуги
            Виконавця в порядку та строки визначені цим Договором.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.2.2.</span> Попереджати якнайменше за 1
            годину до лекції про запізнення на саму лекцію.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.2.3.</span> В будь-яких засобах
            комунікацій із Виконавцем, іншими Замовниками, запрошеними
            викладачами, наставниками та іншими третіми особами не вести
            спілкування та/або дискусію щодо наступних тем: релігія, політика,
            мова, світогляд, стать, расизм, сексизм тощо.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.2.4.</span> Здійснювати регулярно
            перевірку виконаних Замовником домашніх завдань та надавати
            регулярний зворотний зв’язок з приводу виконаних робіт.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.2.5.</span> Не поширювати будь-яку
            інформацію щодо матеріалів навчання у мережі “Інтернет”, зокрема в:
            Telegram, Viber, Facebook, Facebook Messenger, Instagram, Twitter,
            Tik Tok, Вконтакте, Однокласниках, Youtube і тд. У випадку порушення
            авторських прав, Виконавець діє на власний розсуд.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.2.6.</span> Ставитись з повагою і
            розумінням до Виконавця, запрошених ним третіх осіб, та інших
            Замовників, які навчаються.
          </li>
        </ul>
        <ul className="list-inside text-base">
          <li className="flex pt-5 leading-none">
            <span className="pl-16">2.3.</span>
            <p className="pl-1 font-bold">Виконавець має право:</p>
          </li>
          <li className="leading-none">
            <span className="pl-16">2.3.1.</span> Залучати до надання Послуг
            третіх осіб (профільних спеціалістів).
          </li>
          <li className="leading-none">
            <span className="pl-16">2.3.2.</span> Самостійно та на власний
            розсуд добирати програму навчання, організовувати проведення лекцій.
            Проте змінювати розклад тренувань лише у випадку завчасного
            попередження Замовника.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.3.3.</span> У разі порушень зазначених в
            п. 2.2.3 не надати доступ до майбутніх онлайн-лекцій на 5-ий день з
            дня порушення, а саме обмежується доступ до матеріалів зазначених в
            п. 1.3 цього Договору.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.3.4.</span> В односторонньому порядку
            розірвати Договір в разі:
          </li>
          <li className="leading-none">
            <span className="pl-16">2.3.4.1.</span> Порушення Замовником пунктів
            2.2.3., 2.2.5., 2.2.6. цього Договору;
          </li>
          <li className="leading-none">
            <span className="pl-16">2.3.4.2</span> У разі претензій/заперечень
            щодо пункту 6.1, 6.2, 6.3.
          </li>
        </ul>
        <ul className="list-inside text-base">
          <li className="flex pt-5 leading-none">
            <span className="pl-16">2.4.</span>
            <p className="pl-1 font-bold">Замовник має право:</p>
          </li>
          <li className="leading-none">
            <span className="pl-16">2.4.1.</span> Вимагати від Виконавця
            виконання зобов’язань, покладених на нього згідно з умовами цього
            Договору.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.4.2.</span> Вимагати у Виконавця надання
            доступу до навчальних матеріалів, а саме пройдених лекцій.
          </li>
          <li className="leading-none">
            <span className="pl-16">2.4.3.</span> В односторонньому порядку
            розірвати Договір при будь-яких обставинах на власний розсуд, проте
            з дотримання умови зазначену в пункті 3.4. цього Договору.
          </li>
        </ul>
      </div>
      {/* TERM 3 */}
      <div className="mb-6 text-justify leading-none">
        <h1 className="mb-[14px] text-center font-bold">
          3. ВАРТІСТЬ ПОСЛУГ ТА ПОРЯДОК РОЗРАХУНКУ
        </h1>
        <ul className="list-inside text-base">
          <li className="leading-none">
            <span className="pl-16">3.1.</span> Вартість Послуг за цим Договором
            встановлюється Виконавцем та визначається в цьому Договорі. Оплата
            виконується шляхом перерахування грошових коштів на розрахунковий
            рахунок Виконавця зазначений в пункті 3.3. Договору.
          </li>
          <li className="leading-none">
            <span className="pl-16">3.2.</span> Оплата вважається виконаною з
            моменту надходження грошових коштів на розрахунковий рахунок
            Виконавця.
          </li>
          <li className="leading-none">
            <span className="pl-16">3.3.</span>{" "}
            <span className="font-bold underline">
              Перерахована Замовником сума грошових коштів по даному Договору на
              користь Виконавця поверненню не підлягає
            </span>
            . Єдиним винятком є: повернення коштів за перший місяць навчання. У
            випадку бажання повернути кошти Замовник звертається у соціальних
            мережах до Виконавця із проханням повернути кошти не пізніше ніж за
            2 календарних дні до початку дня проведення першої лекції.
          </li>
          <li className="leading-none">
            <span className="pl-16">3.4.</span> Оплата здійснюється Замовником
            за надання доступу до навчання на розрахунковий період, який
            становить 1 (один) календарний місяць.
          </li>
        </ul>
      </div>
      {/* TERM 4 */}
      <div className="mb-6 text-justify leading-none">
        <h1 className="mb-[14px] text-center font-bold">
          4. ВІДПОВІДАЛЬНІСТЬ СТОРІН
        </h1>
        <ul className="list-inside text-base">
          <li className="leading-none">
            <span className="pl-16">4.1.</span> Сторони несуть відповідальність
            за невиконання або неналежне виконання умов цього Договору
            відповідно до його умов та чинного законодавства.
          </li>
          <li className="leading-none">
            <span className="pl-16">4.2.</span> Жодна із сторін не несе
            вiдповiдальнiсть за невиконання або неналежне виконання своїх
            зобов'язань за цим Договором, якщо таке невиконання чи неналежне
            виконання обумовлено дією обставин непереборної сили.
          </li>
          <li className="leading-none">
            <span className="pl-16">4.3.</span> Лекції, які припадають на
            державні свята, відпрацьовуються на загальних підставах. Виконавець
            додатково повідомляє Замовника про дату і час лекції.
          </li>
          <li className="leading-none">
            <span className="pl-16">4.4.</span> Виконавець несе відповідальність
            виключно за ті зобов'язання, які визначені Договором та чинним
            Законодавством.
          </li>
        </ul>
      </div>
      {/* TERM 5 */}
      <div className="mb-6 text-justify leading-none">
        <h1 className="mb-[14px] text-center font-bold">
          5. ПОРЯДОК ВИРІШЕННЯ СПОРІВ
        </h1>
        <ul className="list-inside text-base">
          <li className="leading-none">
            <span className="pl-16">5.1.</span> Усі розбіжності та спори, які
            можуть виникнути між Сторонами цього Договору вирішуються шляхом
            переговорів.
          </li>
          <li className="leading-none">
            <span className="pl-16">5.2.</span> Якщо Сторони в результаті
            переговорів не змогли досягти взаємноï згоди щодо розбіжностей, що
            виникли, а також у разі якщо одна зі Сторін ухиляється від
            проведення переговорів, спір вирішується в судовому порядку,
            встановленому законодавством України.
          </li>
          <li className="leading-none">
            <span className="pl-16">5.3.</span> В разі порушення Стороною умов
            даного Договору, інша Сторона не несе відповідальності за виконання
            зобов'язань за даним Договором.
          </li>
          <li className="leading-none">
            <span className="pl-16">5.4.</span> Порушенням зобов'язання є його
            невиконання або неналежне виконання, тобто виконання з порушенням
            умов, визначених змістом зобов'язання.
          </li>
          <li className="leading-none">
            <span className="pl-16">5.5.</span> Сторони не несуть
            вiдповiдальнiсть за порушення своїх зобов'язань за цим Договором,
            якщо воно сталося не з їх вини.
          </li>
          <li className="leading-none">
            <span className="pl-16">5.6.</span> Жодна зі Сторін не несе
            вiдповiдальнiсть за невиконання чи неналежне виконання своїх
            зобов'язань по цьому Договору, якщо це невиконання чи неналежне
            виконання зумовлені дією обставин непереборної сили (форс-мажорних
            обставин). Сторона, для якої склались форс-мажорні обставини,
            зобов'язана не пізніше 3 (трьох) календарних днів з дати настання
            таких обставин повідомити у письмовій формі іншу Сторону.
          </li>
          <li className="leading-none">
            <span className="pl-16">5.7.</span> Договір може бути розірваним за
            взаємною згодою Сторін. Одностороннє розірвання Договору можливе
            лише в випадках, передбачених цим Договором та законодавством
            України.
          </li>
        </ul>
      </div>
      {/* TERM 6 */}
      <div className="mb-6 text-justify leading-none">
        <h1 className="mb-[14px] text-center font-bold">
          6. ЗАПЕВНЕННЯ ТА ГАРАНТІЯ
        </h1>
        <ul className="list-inside text-base">
          <li className="leading-none">
            <span className="pl-16">6.1.</span> Виконавець не гарантує отримання
            роботи в ІТ-сфері, оскільки вся відповідальність за це лежить на
            Замовнику.
          </li>
          <li className="leading-none">
            <span className="pl-16">6.2.</span> Виконавець не несе
            вiдповiдальнiсть за освоєння Замовником матеріалів у процесі
            навчання.
          </li>
          <li className="leading-none">
            <span className="pl-16">6.3.</span> Виконавець не несе
            відповідальність за якість і однозначність поданої інформації
            Замовнику у процесі навчання.
          </li>
          <li className="leading-none">
            <span className="pl-16">6.4.</span> Сторони засвідчують однакове
            розуміння ними умов Договору та його правових наслідків,
            підтверджують дійсність ïх намірів при його укладенні, а також те,
            що Договір не містить ознак фіктивного або удаваного правочину, що
            він не укладений під впливом помилки щодо його природи, прав та
            обов'язків Сторін, а також під впливом обману чи збігу тяжких
            обставин, умови Договору не є обтяжливими для жодної зі Сторін.
          </li>
          <li className="leading-none">
            <span className="pl-16">6.5.</span> Шляхом підписання Договору
            Замовник заявляє та гарантує Виконавцю наступне:
          </li>
          <li className="leading-none">
            <span className="pl-16">6.5.1.</span> Замовник має необхідний обсяг
            дієздатності та правоздатності для укладення та виконання Договору.
          </li>
          <li className="leading-none">
            <span className="pl-16">6.5.2</span> Умови договору не суперечать
            жодним положенням договорів, укладених Замовником з iншими особами,
            або умовам інших правочинів, дія яких поширюється на Замовника за
            законодавством, будь-яким рішенням суду, органів державної влади або
            місцевого самоврядування.
          </li>
          <li className="leading-none">
            <span className="pl-16">6.5.3</span> Всі документи, які подаються
            Замовником у зв'язку з укладенням/виконанням Договору або на вимогу
            Виконавця, є дійсними та достовірними.
          </li>
          <li className="leading-none">
            <span className="pl-16">6.6.</span> Всі запевнення та гарантії,
            викладені в цьому розділі Договору, повинні залишатися чинними та
            такими, що відповідають дійсності, та застосовуватися протягом
            всього строку дії Договору.
          </li>
          <li className="leading-none">
            <span className="pl-16">6.7.</span> Надання Замовником неправдивих
            та/або неточних заяв та/або гарантій, вказаних в цьому розділі
            Договору, є порушенням Договору та підставою для розірвання
            Виконавцем Договору з відшкодуванням Замовником витрат та збитків
            Виконавцю, спричинених таким розірванням.
          </li>
        </ul>
      </div>
      {/* TERM 7 */}
      <div className="mb-6 text-justify leading-none">
        <h1 className="mb-[14px] text-center font-bold">
          7. ЗГОДА НА ОБРОБКУ ПЕРСОНАЛЬНИХ ДАНИХ
        </h1>
        <ul className="list-inside text-base">
          <li className="leading-none">
            <span className="pl-16">7.1.</span> Відповідно до вимог Закону
            України «Про захист персональних даних» в цілях реалізації
            договірних правовідносин Виконавець проводить обробку персональних
            даних Замовника за правилами чинного Законодавства.
          </li>
          <li className="leading-none">
            <span className="pl-16">7.2.</span> Шляхом підписання до цього
            Договору Замовник, враховуючи вимоги Закону України «Про захист
            персональних даних», надає Виконавцю свою згоду на:
          </li>
          <li className="leading-none">
            <span className="pl-16">7.2.1</span> Збір та обробку персональних
            даних Замовника, з метою організації та надання Виконавцем Замовнику
            Послуг, а також здійснення Виконавцем іншої діяльності відповідно до
            вимог Договору та в порядку, визначеному Законодавством.
          </li>
          <li className="leading-none">
            <span className="pl-16">7.2.2.</span> Поширення персональних даних
            щодо Замовника, надання доступу до них третім особам у випадках,
            передбачених Законодавством та/або Договором, з метою виконання
            зобов'язань за цим Договором.
          </li>
          <li className="leading-none">
            <span className="pl-16">7.2.3</span> Внесення персональних даних
            Замовника до баз персональних даних Виконавця.
          </li>
          <li className="leading-none">
            <span className="pl-16">7.3.</span> Замовник підтверджує, що він:
          </li>
          <li className="leading-none">
            <span className="pl-16">6.3.1</span> Належним чином повідомлений
            (проінформований) Виконавцем в момент приєднання до Договору про те,
            що Виконавець є володільцем персональних даних щодо нього, про склад
            та зміст зібраних Виконавцем персональних даних, мету обробки
            персональних даних та третіх осіб, яким такi данi передаватимуться,
            а також про його права як суб'єкта персональних даних, визначені
            Законом України «Про захист персональних даних».
          </li>
          <li className="leading-none">
            <span className="pl-16">7.3.2</span> Відмовляється від свого права
            отримувати повідомлення про передачу/надання доступу до його
            персональних даних третім особам, а Виконавець відповідно не повинен
            повідомляти Замовника про таку передачу/надання доступу та
            звільняється від відповідальності за нездійснення зазначеного
            повідомлення.
          </li>
        </ul>
      </div>
      {/* TERM 8 */}
      <div className="mb-6 text-justify leading-none">
        <h1 className="mb-[14px] text-center font-bold">
          8. ПРИКІНЦЕВІ ПОЛОЖЕННЯ
        </h1>
        <ul className="list-inside text-base">
          <li className="leading-none">
            <span className="pl-16">3.1.</span> Цей Договір набуває чинності з
            дня проведення першої лекції і діє до дня (включно) проведення
            останньої лекції, якщо цей Договір не був розірваний раніше в
            односторонньому випадку відповідно до умов Договору.
          </li>
          <li className="leading-none">
            <span className="pl-16">3.2.</span> Укладаючи цей Договір, Замовник
            автоматично погоджується з повним та безумовним прийняттям положень
            Договору.
          </li>
          <li className="leading-none">
            <span className="pl-16">3.3.</span> Додатки до цього Договору є його
            невід’ємною частиною.
          </li>
          <li className="leading-none">
            <span className="pl-16">3.4.</span> Цей Договір є договором
            приєднання вiдповiдно до статей 634, 641 Цивільного кодексу України
            і його умови однакові для всіх Замовників. Прийняття умов цього
            Договору є повним і беззастережним і означає згоду Замовника з усіма
            умовами Договору без виключення i i доповнення, а також свідчить про
            те, що Замовник розуміє значення своїх дій, всі умови Договору йому
            зрозумілі. Замовник не знаходиться під впливом помилки, обману,
            насильства, погрози. тяжких обставин.
          </li>
        </ul>
      </div>
    </div>
  );
}
